# SteelElemCopeZAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemCopeZAngle Property
ParameterTypeId Class See Also
---
"Plan rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemCopeZAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemCopeZAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemCopeZAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace